// import { combinationSum2, combinationSum2Pro } from './10-isMatch';

test('0040', () => {
  expect(1).toEqual(1);
});

// 基本情况可以计算
// console.log(combinationSum2([10,1,2,7,6,1,5], 8));
// console.log(combinationSum2([1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1], 27));
// console.log(combinationSum2([2,5,2,1,2], 5));
// // 下面的情况，时间比较慢，需要处理一下
// console.log(combinationSum2([1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1], 10));
// console.log(combinationSum2([1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1], 30));
